Tekla.Structures.Drawing.OpenGraphicObject
The OpenGraphicObject class is an abstract base class for all open graphic objects
(the arc, the line and the polyline).

Tekla.Structures.Drawing.OpenGraphicObject.#ctor
Base constructor.